### Terraformの各結果
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation `success`

<details><summary>Terraform Plan</summary>

```terraform
module.compute.data.aws_ami.amazon_linux: Reading...
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-0a329c3e6b7d95080]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-04ca38f0293e74e57]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-06aacb44743a9153f]
module.network.aws_route_table.rtb: Refreshing state... [id=rtb-037ed182e8878ec73]
module.network.aws_subnet.subnet: Refreshing state... [id=subnet-0ccb1041be35a4046]
module.network.aws_security_group.sg: Refreshing state... [id=sg-008c2dc39c2478aef]
module.network.aws_route_table_association.rtba: Refreshing state... [id=rtbassoc-00099dc29684dad16]
module.network.aws_route.route: Refreshing state... [id=r-rtb-037ed182e8878ec731080289494]
module.compute.aws_instance.ec2: Refreshing state... [id=i-077a318dcd5fcdda1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.compute.aws_instance.ec2 must be replaced
-/+ resource "aws_instance" "ec2" {
      ~ ami                                  = "ami-00d1d099505d27e87" -> "ami-04ca38f0293e74e57" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:657709068990:instance/i-077a318dcd5fcdda1" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-077a318dcd5fcdda1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01433b2c3a7aff255" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-145.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.145" -> (known after apply)
      ~ public_dns                           = "ec2-3-112-225-64.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.112.225.64" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "ec2-t2-micro"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-01433b2c3a7aff255" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0bcc01e5222f09116" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ec2_public_dns = "ec2-3-112-225-64.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
  ~ ec2_public_ip  = "3.112.225.64" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>